Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: A Boolean value indicating whether the scalar’s normalized form differs from the uppercaseMapping of each constituent scalar.
ja: このスカラーのもつ正規化形式が、各構成スカラーのuppercaseMappingと異なるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar’s normalized form differs from the case-fold mapping of each constituent scalar.
ja: このスカラーのもつ正規化形式が各構成スカラーのケースフォルド・マッビングと異なるかどうかを指し示すブール値。

source: A Boolean value indicating whether the scalar’s principal function is to extend the value or shape of a preceding alphabetic scalar.
ja: このスカラーのもつ主要機能が先行するアルファベットのスカラーの値や形状を拡張することであるかどうかを指し示すブール値。

source: A Boolean value indicating whether there are no more elements left to be decoded in the container.
ja: コンテナの中にデコードされるための要素がこれ以上残ってないかどうかを指し示すブール値。

source: A Boolean value indicating whether this type is a signed integer type.
ja: この型が符号付き整数型であるかどうかを指し示すブール値。

source: A Boolean value that indicates whether the group has any remaining tasks.
ja: あるブール値、それはグループが何か残っているタスクを持つかどうかを指し示します。

source: A Boolean value that indicates whether the group was canceled.
ja: あるブール値、それはグループが取り消されたかどうかを指し示す。

source: A Boolean value that indicates whether the static string represents only ASCII code units (or an ASCII scalar value).
ja: あるブール値、それはその静的文字列がASCIIコード単位（またはASCIIスカラー値）だけを表すかどうかを指し示します。

source: A Boolean value that indicates whether the static string stores a pointer to a null-terminated sequence of UTF-8 code units.
ja: あるブール値、それはその静的文字列があるnull終端された一連のUTF-8コード単位へのあるポインタを格納するかどうかを指し示します。

source: A C0 or C1 control code.
ja: C0 または C1 制御コード。

source: A SIMD vector of a fixed number of elements.
ja: 固定された数の要素のSIMDベクター。

source: A UTF-16 code unit.
ja: １つのUTF-16コード単位。

source: A UTF-16 encoding of self.
ja: selfのUTF-16符号化。

source: A UTF-8 code unit.
ja: １つのUTF-8コード単位。

source: A UTF-8 encoding of self.
ja: selfのUTF-8符号化。

source: A Unicode encoding form that translates between Unicode scalar values and form-specific code units.
ja: あるユニコード符号化形式、それはユニコードスカラー値と形式特有のコード単位の間で翻訳します。

source: A Unicode scalar value.
ja: あるユニコードスカラー値。

source: A Unicode string value that is a collection of characters.
ja: あるユニコード文字列値、それは、いくらかの文字からなる１つのコレクションです。

source: A bit pattern to use for the address of the new pointer.
ja: 新しいポインタのアドレスのために使われるビットパターン。

source: A bitwise AND operation results in a value that has each bit set to 1 where both of its arguments have that bit set to 1.
ja: ビット単位AND演算は、ある値という結果になります、それが各ビットを1に設定するのは、両方のそれの引数が、そのビットを1に設定するところです。

source: A bitwise OR operation results in a value that has each bit set to 1 where one or both of its arguments have that bit set to 1.
ja: ビット単位OR演算は、ある値という結果になります、それが各ビットを1に設定するのは、一方または両方のそれの引数が、そのビットを1に設定するところです。

source: A bitwise XOR operation, also known as an exclusive OR operation, results in a value that has each bit set to 1 where one or the other but not both of its arguments had that bit set to 1.
ja: ビット単位XOR演算、または排他的OR演算として知られるものは、１つの値という結果になり、それは各ビットが1に設定されます、そこにおいて一方または他方しかし両方でなくそれの引数がそのビットを1に設定されます。

source: A buffer of raw bytes from which to copy.
ja: 生のバイトのバッファで、それからコピーします。

source: A buffer pointer to a newly allocated region of memory aligned to alignment.
ja: alignmentにアラインされた新規割り当てのメモリ領域へのバッファポインタ。

source: A cancelled group will not will create new tasks when the asyncUnlessCancelled, function is used.
ja: 取り消されたグループは、asyncUnlessCancelled関数が使われる場合は新しいタスクを作成しません。

source: A class instance.
ja: あるクラスインスタンス。

source: A class of types whose instances hold the value of an entity with stable identity.
ja: それらのインスタンスはある登録項目の値を安定した同一性で保持するところの型それらのクラス。

source: A class whose instances contain a property of type Header and raw storage for an array of Element, whose size is determined at instance creation.
ja: あるクラス、そのインスタンスは型Headerのプロパティと、そのサイズがインスタンス作成時に決められる、Element配列の生のストレージを含みます。

source: A closing punctuation mark of a pair.
ja: ある対のある閉じ句読点符号。

source: A closure that accepts a buffer covering uninitialized memory with room for capacity UTF-8 code units, initializes that memory, and returns the number of initialized elements.
ja: あるクロージャ、それはcapacityのUTF-8単位に対する空き場所をもつ初期化されないメモリを扱うバッファを受け入れ、そのメモリを初期化し、そして初期化された要素の数を返します。

source: A closure that accepts an element of this sequence as its argument and returns a sequence or collection.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、あるシーケンスまたはコレクションを返すものです。

source: A closure that accepts an element of this sequence as its argument and returns an optional value.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、ひとつのオプショナルの値を返すものです。

source: A closure that combines an accumulating value and an element of the asynchronous sequence into a new accumulating value, for use in the next call of the nextPartialResult closure or returned to the caller.
ja: あるクロージャ、それは蓄積値と非同期シーケンスのいち要素を新しい蓄積値へと結合します、nextPartialResultクロージャの次の呼び出しにおいて使うためにまたは呼び出し側に返されるように。

source: A closure that combines an accumulating value and an element of the sequence into a new accumulating value, to be used in the next call of the nextPartialResult closure or returned to the caller.
ja: あるクロージャ、それは蓄積値をシーケンスのいち要素と結合して新しい蓄積値とし、nextPartialResultクロージャの次の呼び出しにおいて使われるか、呼び出し側に返されるようにします。

source: A closure that processes one code unit argument at a time.
ja: あるクロージャ、それは一度に１つのコードユニット引数を処理します。

source: A closure that returns true if its argument should be used to split the sequence; otherwise, false.
ja: １つのクロージャ、それはそれの引数が使われてシーケンスを分割するならばtrueを；そうでなければ、falseを返します。

source: A closure that returns a Boolean value indicating whether two elements are equivalent.
ja: ２つの要素が等しいかどうかを指し示しているブール値を返すクロージャ。

source: A closure that takes a buffer pointer to the static string’s UTF-8 code unit sequence as its sole argument.
ja: あるクロージャ、それは静的文字列のもつUTF-8コード単位シーケンスへのバッファポインタをそれの唯一の引数として取るものです。

source: A closure that takes a mutable typed buffer to the same memory as this buffer, only bound to type T.
ja: あるクロージャ、それは、型Tに束縛しただけの、このバッファと同じメモリに対する可変の型付バッファをとります。

source: A closure that takes a mutable typed pointer to the same memory as this pointer, only bound to type T.
ja: あるクロージャ、それは、型Tに束縛しただけの、このポインタと同じメモリへの可変の型付ポインタをとります。

source: A closure that takes a typed buffer to the same memory as this buffer, only bound to type T.
ja: あるクロージャ、それは、型Tに束縛しただけの、このバッファと同じメモリに対する型付バッファをとります。

source: A closure that takes a typed pointer to the same memory as this pointer, only bound to type T.
ja: あるクロージャ、それは、型Tに束縛しただけの、このポインタと同じメモリへの型付ポインタをとります。

source: A closure that takes an element as a parameter and returns a Boolean value indicating whether the element should be included in the modified sequence.
ja: あるクロージャ、それはある要素をパラメータとして取り、その要素がこの修正後のシーケンスに含まれるべきかどうかを指し示すブール値を返すものです。

source: A closure that takes an element as a parameter and returns a Boolean value indicating whether to drop the element from the modified sequence.
ja: あるクロージャ、それはある要素をパラメータとして取り、その要素をこの修正後のシーケンスから抜かすことになるかどうかを指し示すブール値を返すものです。

source: A closure that takes an element as an argument and returns a Boolean value indicating whether the collection should be split at that element.
ja: あるクロージャ、それは１つの要素を引数として取り、コレクションがその要素で分割されるかどうかを指し示すブール値を返します。

source: A closure that takes an element as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether the element is a match.
ja: あるクロージャ、それは非同期シーケンスの１つの要素をそれの引数として取り、その要素があるマッチであるかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それはこの非同期シーケンスの１つの要素をそれの引数として取り、渡された要素があるマッチを表すかどうかを指し示すブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether the passed element satisfies a condition.
ja: あるクロージャ、それはこの非同期シーケンスの１つの要素をそれの引数として取り、渡された要素がある条件を満たすかどうかを指し示すブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether to include the element in the filtered sequence.
ja: あるクロージャ、それは非同期シーケンスの１つの要素をそれの引数として取り、その要素をこの平坦化されたシーケンスに含むことになるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as a parameter.
ja: あるクロージャ、それはシーケンスの１要素を引数として取ります。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be included or false if it should be excluded.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が含まれるべきならばtrueをまたはそれが除外されるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be skipped or false if it should be included.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が省かれるべきならばtrueをまたはそれが含まれるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element is a match.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が合致するものかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the result.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が結果に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the returned array.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が返される配列に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the returned collection.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が返されるコレクションに含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be removed from the collection.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素がコレクションから除去されるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element satisfies a condition.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素がある条件を満たすかどうかを指し示すブール値を返します。

source: A closure that updates the accumulating value with an element of the sequence.
ja: 蓄積される値をこのシーケンスのある要素を使って更新するクロージャ。

source: A closure with a pointer parameter that points to a null-terminated sequence of UTF-8 code units.
ja: UTF-8コード単位のnull終端シーケンスを指し示すポインタパラメータを持つクロージャ。

source: A closure with a pointer parameter that points to a null-terminated sequence of code units.
ja: コード単位からなるnull終端シーケンスを指し示すポインタパラメータを持つクロージャ。

source: A collection containing a single element.
ja: 単一の要素を含んでいるコレクション。

source: A collection containing the same elements as a Base collection, but on which some operations such as map and filter are implemented lazily.
ja: Baseコレクションと同じ要素を含んでいるあるコレクション、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A collection containing the words of this value’s binary representation, in order from the least significant to most significant.
ja: この値の持つバイナリ表現の単語いくらかを含んでいるコレクション、最下位から最上位への順番で。

source: A collection of Character elements to insert into the string.
ja: 文字列へ挿入されることになるCharacter要素からなるコレクション。

source: A collection of UInt8 elements.
ja: UInt8要素からなるコレクション。

source: A collection of Unicode scalar values.
ja: ユニコードスカラー値のコレクション。

source: A collection of code units encoded in the encoding specified in sourceEncoding.
ja: sourceEncodingにおいて指定されたエンコーディングでエンコードされたコード単位からなるコレクション。

source: A collection of indices for an arbitrary collection
ja: 不定なコレクションのためのインデックスのコレクション

source: A collection of insertions and removals that describe the difference between two ordered collection states.
ja: ２つの順序付きコレクション状態の間の差異を記述するいくらかの挿入と除去からなるあるコレクション。

source: A collection of the elements that isIncluded allowed.
ja: isIncludedを認められた要素それらからなるあるコレクション。

source: A collection on which normally-eager operations such as map and filter are implemented lazily.
ja: あるコレクション、それにおいては通常は先行な演算、例えばmapやfilterは、遅延に実装されます。

source: A collection or finite sequence.
ja: コレクションまたは有限のシーケンス。

source: A collection that presents the elements of its base collection in reverse order.
ja: あるコレクション、それは、それの基盤コレクションの要素を逆順で提示します。

source: A collection that supports backward as well as forward traversal.
ja: 前方にだけでなく後方へ辿っていくこともサポートするコレクション。

source: A collection that supports efficient random-access index traversal.
ja: 効率のよい無作為アクセスのインデックス探査をサポートするコレクション。

source: A collection that supports replacement of an arbitrary subrange of elements with the elements of another collection.
ja: 随意の下位範囲の要素を別のコレクションの要素で置き換えることをサポートするコレクション。

source: A collection that supports subscript assignment.
ja: 添え字を使った代入をサポートするコレクション。

source: A collection whose element type is Element but that is always empty.
ja: それの要素型はElementである、しかし常に空であるコレクション。

source: A collection whose elements are all identical.
ja: あるコレクション、その要素は全て同一です。

source: A collection whose elements are key-value pairs.
ja: それの要素がキー値ペアであるコレクション。

source: A collection’s indices property can hold a strong reference to the collection itself, causing the collection to be non-uniquely referenced.
ja: あるコレクションのindicesプロパティは、そのコレクション自身に対する強い参照を保持でき、そのコレクションが特有にでなくとも参照されるようにします。

source: A collection’s indices property can hold a strong reference to the collection itself, causing the collection to be nonuniquely referenced.
ja: あるコレクションのindicesプロパティは、そのコレクション自身に対する強い参照を保持でき、そのコレクションが非特有に参照されるようにします。

source: A concrete container that provides a view into a decoder’s storage, making the encoded properties of a decodable type accessible by keys.
ja: ある具体的なコンテナで、あるデコーダの持つストレージへのビューを提供します、デコーダ可能型のエンコードされたプロパティをキーによってアクセス可能にしています。

source: A concrete container that provides a view into an encoder’s storage, making the encoded properties of an encodable type accessible by keys.
ja: ある具体的なコンテナで、あるエンコーダの持つストレージへのビューを提供します、エンコード可能型のエンコードされたプロパティをキーによってアクセス可能にしています。

source: A connecting punctuation mark, like a tie.
ja: 連結句読点符号、tieのような。

source: A container that can support the storage and direct decoding of a single nonkeyed value.
ja: 単一非キー値のストレージおよび直接デコーディングをサポートできるコンテナ。

source: A container that can support the storage and direct encoding of a single non-keyed value.
ja: 単一非キー値のストレージおよび直接エンコーディングをサポートできるコンテナ。

source: A contiguously stored null-terminated UTF-8 representation of the string.
ja: 隣接格納されるヌル終端UTF-8表現のこの文字列。

source: A continuation must be resumed exactly once.
ja: 継続は、厳密に一度だけ再開されなければなりません。

source: A currency sign.
ja: 通貨符号。

source: A custom playground Quick Look for the String instance.
ja: Stringインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the UInt16 instance.
ja: UInt16インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the UInt32 instance.
ja: UInt32インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the UInt64 instance.
ja: UInt64インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the UInt8 instance.
ja: UInt8インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the UInt instance.
ja: UIntインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the Unicode.Scalar instance.
ja: Unicode.Scalarインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for this instance.
ja: このインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A dash or hyphen punctuation mark.
ja: ダッシュまたはハイフン句読点符号。

source: A decimal digit.
ja: ある10進法数字。

source: A decoded Unicode scalar value.
ja: デコードされたユニコードスカラー値。

source: A decoded value of the requested type, or nil if the value is a null value, or if there are no more elements to decode.
ja: 要求された型にデコード済みの値、またはnil、もしその値がnull値ならば、またはもしデコードする要素がそれ以上ないならば。

source: A default implementation of this method will be provided automatically for any conforming type that does not implement one.
ja: このメソッドの省略時の実装は、それを実装していないあらゆる準拠している型に対して自動的に提供されるでしょう。

source: A detached task always runs to completion unless it is explicitly cancelled.
ja: 分離されたタスクは、常に完了まで動作します、それが明示的に取り消されない限り。

source: A digit that does not meet the requirements of the decimal numeric type or a non-digit numeric value.
ja: decimal数値型の要件を満たさない桁または非桁数値。

source: A digit that does not meet the requirements of the decimal numeric type.
ja: decimal数値型の要件を満たさない桁。

source: A digit that is commonly understood to form base-10 numbers.
ja: 一般に底10の数の形式に理解される桁。

source: A digraph character whose first part is uppercase.
ja: それの最初の部分が大文字である連字文字。

source: A double-precision, floating-point value type.
ja: 倍精度、浮動小数点値型。

source: A dynamic plain-text Unicode string object, for use instead of a String variable in cases that require reference semantics.
ja: 動的なプレーンテキストユニコード文字列オブジェクト、参照意味論を必要とする場合にString変数の代わりに使うため。

source: A final quotation mark.
ja: 最後の引用符。

source: A flattened view of the elements of this sequence of sequences.
ja: 複数のシーケンスからなるこのシーケンスの要素のある平坦なビュー。

source: A floating-point numeric type.
ja: 浮動小数点数値型。

source: A floating-point value to convert to an integer.
ja: 整数へと変換する浮動小数点値．

source: A format control character.
ja: 書式制御文字。

source: A grapheme base can be thought of as a space-occupying glyph above or below which other non-spacing modifying glyphs can be applied.
ja: 書記素基底は、それの上または下に他の無間隔修飾字体が適用できる場所取り字体として考えることができます。

source: A grapheme extender can be thought of primarily as a non-spacing glyph that is applied above or below another glyph.
ja: 初期素拡張は概ね別の字体の上または下に適用される無間隔字体として考えられます。

source: A half-open interval from a lower bound up to, but not including, an upper bound.
ja: 下側の境界から、上側の境界まで、しかしそれを含んでいない、半開間隔。

source: A half-precision (16b), floating-point value type.
ja: 半精度（16b）、浮動小数点値型。

source: A key path from a specific root type to a specific resulting value type.
ja: 特定の根本の型から特定の結果値の型へのキーパス。

source: A key path is a string of dot-separated keys that specifies a sequence of object properties to traverse.
ja: キーパスは、辿っていく一連のオブジェクトプロパティを指定する、ドット区切りのキーの文字列です。

source: A key path that supports reading from and writing to the resulting value with reference semantics.
ja: 結果値からのよみ出し及びそれへの書き込みを参照意味論でサポートするキーパス。

source: A key path that supports reading from and writing to the resulting value.
ja: 結果値からのよみ出し及びそれへの書き込みをサポートするキーパス。

source: A keyed decoding container view into self.
ja: selfへのキー付きデコーディングコンテナビュー。

source: A lazy Collection wrapper that includes the elements of an underlying collection that satisfy a predicate.
ja: 遅延なCollectionラッパー、それは根底にあるコレクションの要素のうち、ある述部を満足させるものを含めます。

source: A lazy collection wrapper that includes the initial consecutive elements of an underlying collection that satisfy a predicate.
ja: 遅延collectionラッパー、それは根底にあるコレクションのうち、ある述部を満足させる、最初の連続した要素を含みます。

source: A lazy wrapper that includes the elements of an underlying collection after any initial consecutive elements that satisfy a predicate.
ja: 遅延なラッパー、それは根底にあるコレクションのうち、ある述部を満足させる何らかの最初の連続した要素の後ろの要素らを含みます。

source: A letter-like numeric character.
ja: 文字のような数字。

source: A lightweight collection of key-value pairs.
ja: キー値ペアの軽量コレクション。

source: A line separator, which is specifically (and only) U+2028 LINE SEPARATOR.
ja: 行分離子、それは具体的には（そして唯一）U+2028 LINE SEPARATOR です。

source: A lookup made from the context of a synchronous function, that is not called from an asynchronous function (!), will immediately return the task-local’s default value.
ja: 同期関数の文脈から作られた検索は、それは非同期関数から呼び出されません（！）、直ぐにタスクローカルのもつ省略時の値を返すでしょう。

source: A lowercase copy of the string.
ja: 文字列の小文字でのコピー。

source: A lowercase letter.
ja: 小文字。

source: A mapping closure.
ja: マップを行うクロージャ。

source: A mechanism to interface between synchronous and asynchronous code, logging correctness violations.
ja: 同期と非同期のコードの間を取り持つためのある仕組み、それは正確さ侵害を記録します。

source: A mechanism to interface between synchronous and asynchronous code, without correctness checking.
ja: 同期と非同期のコードの間を取り持つための仕組み、正確さ検査なしで。

source: A memory location may only be bound to one type at a time, so accessing the same memory as an unrelated type without first rebinding the memory is undefined.
ja: あるメモリ位置は一度に１つの型へとバインド（束縛）されるだけでしょう、なので同じメモリに関連のない型として最初にメモリ再バインドすることなしにアクセスすることは、未定義となります。

source: A memory location may only be bound to one type at a time.
ja: あるメモリ位置は、一度に１つの型に束縛されるだけでしょう。

source: A mirror that reflects the String instance.
ja: Stringインスタンスを反映するミラー。

source: A mirror that reflects the UInt16 instance.
ja: UInt16インスタンスを反映するミラー。

source: A mirror that reflects the UInt32 instance.
ja: UInt32インスタンスを反映するミラー。

source: A mirror that reflects the UInt64 instance.
ja: UInt64インスタンスを反映するミラー。

source: A mirror that reflects the UInt8 instance.
ja: UInt8インスタンスを反映するミラー。

source: A mirror that reflects the UInt instance.
ja: UIntインスタンスを反映するミラー。

source: A mirror that reflects the Unicode.Scalar instance.
ja: Unicode.Scalarインスタンスを反映するミラー。

source: A modifier letter.
ja: 修飾文字。

source: A mutable nonowning collection interface to the bytes in a region of memory.
ja: メモリのいち領域中のバイトに対する可変の非所有コレクションインターフェイス。

source: A mutable pointer addressing an Objective-C reference that doesn’t own its target.
ja: それのターゲットを所有しないObjective-C参照をアドレス指定している可変ポインタ。

source: A mutable pointer to the elements of an array is implicitly created when you pass the array using inout syntax.
ja: 配列の要素への可変ポインタは、あなたが配列をinout構文を使って渡す時に暗黙的に作成されます。

source: A namespace for Unicode utilities.
ja: ユニコードユーティリティのための名前空間。

source: A new Decoder to pass to super.init(from:).
ja: super.init(from:)に渡すための新しいDecoder。

source: A new encoder to pass to super.encode(to:).
ja: super.encode(to:)に渡すための新しいエンコーダ。

source: A new instance initialized with rawValue will be equivalent to this instance.
ja: rawValueで初期化された新しいインスタンスは、このインスタンスに相当します。

source: A new instance of type T, copied from the buffer pointer’s memory.
ja: 型Tの新しいインスタンス、バッファポインタのもつメモリからコピーされます。

source: A new instance of type T, read from the raw bytes at offset.
ja: 型Tの新しいインスタンス、offsetで生のバイトから読み込んだもの。

source: A new keyed encoding container.
ja: 新しいキー付けされるエンコーディングコンテナ。

source: A new unkeyed encoding container.
ja: 新しいキー付けされないエンコーディングコンテナ。

source: A non-letterlike modifier symbol.
ja: 文字でないような修飾記号。

source: A non-spacing combining mark with zero advance width (abbreviated Mn).
ja: ゼロ送り幅をもつ非空白結合記号（省略してMn）。

source: A nonowning collection interface to a buffer of elements stored contiguously in memory.
ja: メモリ中に隣接して格納された、いくらかの要素からなるあるバッファに対する非所有コレクションインターフェイス。

source: A nonowning collection interface to a buffer of mutable elements stored contiguously in memory.
ja: メモリ中に隣接して格納された、いくらかの可変の要素からなるあるバッファに対する非所有コレクションインターフェイス。

source: A nonowning collection interface to the bytes in a region of memory.
ja: メモリのいち領域中のバイトに対する非所有コレクションインターフェイス。

source: A numeric character of another type.
ja: 別の型の数字文字。

source: A numeric representation of the Unicode scalar.
ja: ユニコードスカラーの数値表現。

source: A numeric value.
ja: ある数値。

source: A paragraph separator, which is specifically (and only) U+2029 PARAGRAPH SEPARATOR.
ja: 段落分離子、それは具体的には（そして唯一）U+2029 PARAGRAPH SEPARATOR です。

source: A partial half-open interval up to, but not including, an upper bound.
ja: 上側の境界までの、しかしそれを含まない部分的半開間隔。

source: A partial interval extending upward from a lower bound.
ja: ある下側の境界から上向きに拡張する部分的な間隔。

source: A partial interval up to, and including, an upper bound.
ja: ある上側の境界までの、そしてそれを含んでいる部分的な間隔。

source: A partially type-erased key path, from a concrete root type to any resulting value type.
ja: ある部分的な型消去キーパス、具体的な根本の型から何らかの結果値の型への。
